## Plan Result (883: prod_ai - TerraformPlanApply)




<pre><code>Plan: 11 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.ai.azurerm_machine_learning_compute_instance.compute_instance[0]
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.ai.azurerm_private_endpoint.ml_private_endpoint
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account[&#34;dlrm-ingest-ci-prod1&#34;]
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.ml_contributor_from_to_ai_storage_account
  * module.ai.azurerm_role_assignment.ml_contributor_to_file_storage_account[0]
* Update
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_storage_account.workspace_storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-prod"
        name                           = "dlrm-ingest-ai-foundry-prod"
      ~ tags                           = {
          - "__SYSTEM__AIServices_Enda-m9gxngd8-uksouth"                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AIServices_dlrm-aria-document-migration-res"       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__AzureOpenAI_Enda-m9gxngd8-uksouth_aoai"            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AzureOpenAI_dlrm-aria-document-migration-res_aoai" = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__CognitiveSearch_dlrmingestprojectprod"             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Search/searchServices/dlrm-ingest-project-prod" -> null
            "application"                                                 = "dlrm-data-ingest"
            "builtFrom"                                                   = "hmcts/dlrm-data-ingest-infra"
            "businessArea"                                                = "cross-cutting"
            "criticality"                                                 = "High"
            "environment"                                                 = "production"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be updated in-place
  ~ resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-standard-prod"
        name                               = "dlrm-ingest-cognitive-standard-prod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (13 unchanged attributes hidden)

      - network_acls {
          - default_action = "Allow" -> null
          - ip_rules       = [] -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_machine_learning_compute_instance.compute_instance[0] will be created
  + resource "azurerm_machine_learning_compute_instance" "compute_instance" {
      + authorization_type            = "personal"
      + id                            = (known after apply)
      + local_auth_enabled            = true
      + machine_learning_workspace_id = (known after apply)
      + name                          = "dlrm-ingest-ci-prod1"
      + node_public_ip_enabled        = true
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_machine_size          = "Standard_D2ds_v5"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be created
  + resource "azurerm_machine_learning_workspace" "ml_workspace" {
      + application_insights_id       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Insights/components/dlrm-ingest-ai-appinsights-prod"
      + discovery_url                 = (known after apply)
      + id                            = (known after apply)
      + key_vault_id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-prod"
      + kind                          = "Default"
      + location                      = "uksouth"
      + name                          = "dlrm-ingest-ml-workspace-prod"
      + public_network_access_enabled = true
      + resource_group_name           = "dlrm-ingest-ai-prod"
      + sku_name                      = "Basic"
      + storage_account_id            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + v1_legacy_mode_enabled        = false
      + workspace_id                  = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + managed_network {
          + isolation_mode = "AllowInternetOutbound"
        }
    }

  # module.ai.azurerm_private_endpoint.ml_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ml_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-ml-workspace-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ml-workspace-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_blob_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_blob_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_ai_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.compute_contributor_to_file_storage_account["dlrm-ingest-ci-prod1"] will be created
  + resource "azurerm_role_assignment" "compute_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "ml_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_file_storage_account[0] will be created
  + resource "azurerm_role_assignment" "ml_blob_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_contributor_from_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "ml_contributor_from_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_contributor_to_file_storage_account[0] will be created
  + resource "azurerm_role_assignment" "ml_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "workspace_storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
        name                               = "dlrmingestaisaprod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 11 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":106,"Program":"tfcmt","SHA1":"","Target":"883: prod_ai - TerraformPlanApply","Vars":{}} -->